# Combining Python, SQL DBs and AWS

## Aim: Connect to your DB on AWS through python, and execute queries.

# Using Python with MYSQL DB

In [1]:
# make sure we have the package installed
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /Users/JacquesPierre/anaconda3/lib/python3.7/site-packages (8.0.18)
Requirement already satisfied: protobuf>=3.0.0 in /Users/JacquesPierre/anaconda3/lib/python3.7/site-packages (from mysql-connector-python) (3.10.0)
Requirement already satisfied: setuptools in /Users/JacquesPierre/anaconda3/lib/python3.7/site-packages (from protobuf>=3.0.0->mysql-connector-python) (41.4.0)
Requirement already satisfied: six>=1.9 in /Users/JacquesPierre/anaconda3/lib/python3.7/site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.12.0)

In [11]:
## importing 'mysql.connector' 
import mysql.connector

### Documentation:

https://dev.mysql.com/doc/connector-python/en/connector-python-connectargs.html

## Using a config File:

You do not want to make your credentials viewable to everyone who might see this file.  So instead of explicity stating your credentials, we want to import them from another file.

In [12]:
import config

In [13]:
config.password

'flatiron100719'

In [14]:
## Connecting to the database

## connecting to the database using 'connect()' method
## it takes 3 required parameters 'host', 'user', 'passwd'
cnx = mysql.connector .connect(
    host = config.host,
    user = config.user,
    passwd = config.password
)

print(cnx) # it will print a connection object if everything is fine

<mysql.connector.connection.MySQLConnection object at 0x10a80ecf8>

In [15]:
cursor = cnx.cursor()

## SQL Commands: Data Definition Language Commands (DDL)
This section will discuss the commands through which you can define your database. The commands are as follows:

- CREATE
- DROP
- TRUNCATE
- ALTER
- BACKUP DATABASE

### CREATE

This statement is used to create a table or a database.

#### The ‘CREATE DATABASE’ Statement:
As the name suggests, this statement is used to create a database.

**Syntax**

`CREATE DATABASE DatabaseName;`

**Example**

`CREATE DATABASE Employee;`

#### The **‘CREATE TABLE’** Statement

This statement is used to create a table.

**Syntax**

`CREATE TABLE TableName (
Column1 datatype,
Column2 datatype,
Column3 datatype,
....
ColumnN datatype
);`

**Example**

`CREATE TABLE Employee_Info
(
EmployeeID int,
EmployeeName varchar(255),
Emergency ContactName varchar(255),
PhoneNumber int,
Address varchar(255),
City varchar(255),
Country varchar(255)
);`

You can also create a table using another table. Refer the below sytax and example:

#### The ‘CREATE TABLE AS’ Statement
**Syntax**

`CREATE TABLE NewTableName AS
SELECT Column1, column2,..., ColumnN
FROM ExistingTableName
WHERE ....;`

**Example**

`CREATE TABLE ExampleTable AS
SELECT EmployeeName, PhoneNumber
FROM Employee_Info;`

[MYSQL Data Types](http://www.mysqltutorial.org/mysql-data-types.aspx)

### DROP
This statement is used to drop an existing table or a database.

#### The ‘DROP DATABASE’ Statement
This statement is used to drop an existing database. When you use this statement, complete information present in the database will be lost.

**Syntax**

`DROP DATABASE DatabaseName;`

**Example**

`DROP DATABASE Employee;`

#### The ‘DROP TABLE’ Statement
This statement is used to drop an existing table. When you use this statement, complete information present in the table will be lost.

**Syntax**

`DROP TABLE TableName;`

**Example**

`DROP Table Employee_Info;`

### TRUNCATE
This command is used to delete the information present in the table but does not delete the table. So, once you use this command, your information will be lost, but not the table.

**Syntax**

`TRUNCATE TABLE TableName;`

**Example**

`TRUNCATE Table Employee_Info;`

### The ‘ALTER TABLE’ Statement
This statement is used to add, delete, modify columns in an existing table.

#### The ‘ALTER TABLE’ Statement with ADD/DROP COLUMN
You can use the ALTER TABLE statement with ADD/DROP Column command according to your need. If you wish to add a column, then you will use the ADD command, and if you wish to delete a column, then you will use the DROP COLUMN command.

**Syntax**
`ALTER TABLE TableName
ADD ColumnName Datatype;`

`ALTER TABLE TableName
DROP COLUMN ColumnName;`

**Example**

`ALTER TABLE Employee_Info
ADD BloodGroup varchar(255);`
 
`ALTER TABLE Employee_Info
DROP COLUMN BloodGroup ;`

#### The ‘ALTER TABLE’ Statement with ALTER/MODIFY COLUMN
This statement is used to change the datatype of an existing column in a table.

**Syntax**

`ALTER TABLE TableName
ALTER COLUMN ColumnName Datatype;`

**Example**
 
`ALTER TABLE Employee_Info
ADD DOB year;
ALTER TABLE Employee_Info
ALTER DOB date;`

### BACKUP DATABASE
This statement is used to create a full backup of an existing database.

**Syntax**
`BACKUP DATABASE DatabaseName
TO DISK = 'filepath';`

**Example**

`BACKUP DATABASE Employee
TO DISK = 'C:UsersSahitiDesktop';`

## SQL Commands: Constraints Used In Database
Constraints are used in a database to specify the rules for data in a table. The following are the different types of constraints:

- NOT NULL
- UNIQUE
- CHECK
- DEFAULT
- INDEX


### NOT NULL
This constraint ensures that a column cannot have a NULL value.

**Example**

 
`CREATE TABLE Employee_Info
(
EmployeeID int NOT NULL,
EmployeeName varchar(255) NOT NULL,
Emergency ContactName varchar(255),
PhoneNumber int NOT NULL,
Address varchar(255),
City varchar(255),
Country varchar(255)
);`
 
NOT NULL on ALTER TABLE
 
`ALTER TABLE Employee_Info
MODIFY PhoneNumber int NOT NULL;`

### UNIQUE
This constraint ensures that all the values in a column are unique.

**Example**

UNIQUE on Create Table
 
`CREATE TABLE Employee_Info
(
EmployeeID int NOT NULL UNIQUE,
EmployeeName varchar(255) NOT NULL,
Emergency ContactName varchar(255),
PhoneNumber int NOT NULL,
Address varchar(255),
City varchar(255),
Country varchar(255)
);`
 
UNIQUE on Multiple Columns
 
`CREATE TABLE Employee_Info
(
EmployeeID int NOT NULL,
EmployeeName varchar(255) NOT NULL,
Emergency ContactName varchar(255),
PhoneNumber int NOT NULL,
Address varchar(255),
City varchar(255),
Country varchar(255),
CONSTRAINT UC_Employee_Info UNIQUE(Employee_ID, PhoneNumber)
);`
 
UNIQUE on ALTER TABLE
 
`ALTER TABLE Employee_Info
ADD UNIQUE (Employee_ID);`
 
To drop a UNIQUE constraint
 
`ALTER TABLE  Employee_Info
DROP CONSTRAINT UC_Employee_Info;`

## Creating DB

In [16]:
from mysql.connector import errorcode

In [17]:
db_name = 'employees'

In [18]:
def create_database(cursor, database):
    try:
        cursor.execute(
            "CREATE DATABASE {} DEFAULT CHARACTER SET 'utf8'".format(database))
    except mysql.connector.Error as err:
        print("Failed creating database: {}".format(err))
        exit(1)

try:
    cursor.execute("USE {}".format(db_name))
except mysql.connector.Error as err:
    print("Database {} does not exists.".format(db_name))
    if err.errno == errorcode.ER_BAD_DB_ERROR:
        create_database(cursor, db_name)
        print("Database {} created successfully.".format(db_name))
        cnx.database = db_name
    else:
        print(err)
        exit(1)

### Creating tables

In [7]:
DB_NAME = 'employees'

TABLES = {}
TABLES['employees'] = (
    "CREATE TABLE employees ("
    "  emp_no int(11) NOT NULL AUTO_INCREMENT,"
    "  birth_date date NOT NULL,"
    "  first_name varchar(14) NOT NULL,"
    "  last_name varchar(16) NOT NULL,"
    "  gender enum('M','F') NOT NULL,"
    "  hire_date date NOT NULL,"
    "  PRIMARY KEY (emp_no)"
    ") ENGINE=InnoDB")

TABLES['departments'] = (
    "CREATE TABLE departments ("
    "  dept_no char(4) NOT NULL,"
    "  dept_name varchar(40) NOT NULL,"
    "  PRIMARY KEY (dept_no), UNIQUE KEY dept_name (dept_name)"
    ") ENGINE=InnoDB")

TABLES['salaries'] = (
    "CREATE TABLE salaries ("
    "  emp_no int(11) NOT NULL,"
    "  salary int(11) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date NOT NULL,"
    "  PRIMARY KEY (emp_no,from_date), KEY emp_no (emp_no),"
    "  CONSTRAINT salaries_ibfk_1 FOREIGN KEY (emp_no) "
    "     REFERENCES employees (emp_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

TABLES['dept_emp'] = (
    "CREATE TABLE dept_emp ("
    "  emp_no int(11) NOT NULL,"
    "  dept_no char(4) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date NOT NULL,"
    "  PRIMARY KEY (emp_no,dept_no), KEY emp_no (emp_no),"
    "  KEY dept_no (dept_no),"
    "  CONSTRAINT dept_emp_ibfk_1 FOREIGN KEY (emp_no) "
    "     REFERENCES employees (emp_no) ON DELETE CASCADE,"
    "  CONSTRAINT dept_emp_ibfk_2 FOREIGN KEY (dept_no) "
    "     REFERENCES departments (dept_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

TABLES['dept_manager'] = (
    "  CREATE TABLE dept_manager ("
    "  dept_no char(4) NOT NULL,"
    "  emp_no int(11) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date NOT NULL,"
    "  PRIMARY KEY (emp_no,dept_no),"
    "  KEY emp_no (emp_no),"
    "  KEY dept_no (dept_no),"
    "  CONSTRAINT dept_manager_ibfk_1 FOREIGN KEY (emp_no) "
    "     REFERENCES employees (emp_no) ON DELETE CASCADE,"
    "  CONSTRAINT dept_manager_ibfk_2 FOREIGN KEY (dept_no) "
    "     REFERENCES departments (dept_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

TABLES['titles'] = (
    "CREATE TABLE titles ("
    "  emp_no int(11) NOT NULL,"
    "  title varchar(50) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date DEFAULT NULL,"
    "  PRIMARY KEY (emp_no,title,from_date), KEY emp_no (emp_no),"
    "  CONSTRAINT titles_ibfk_1 FOREIGN KEY (emp_no)"
    "     REFERENCES employees (emp_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

In [14]:
TABLES['employees']

"CREATE TABLE employees (  emp_no int(11) NOT NULL AUTO_INCREMENT,  birth_date date NOT NULL,  first_name varchar(14) NOT NULL,  last_name varchar(16) NOT NULL,  gender enum('M','F') NOT NULL,  hire_date date NOT NULL,  PRIMARY KEY (emp_no)) ENGINE=InnoDB"

In [15]:
for table_name in TABLES:
    table_description = TABLES[table_name]
    try:
        print("Creating table {}: ".format(table_name), end='')
        cursor.execute(table_description)
    except mysql.connector.Error as err:
        if err.errno == errorcode.ER_TABLE_EXISTS_ERROR:
            print("already exists.")
        else:
            print(err.msg)
    else:
        print("OK")

cursor.close()
cnx.close()

Creating table employees: already exists.
Creating table departments: already exists.
Creating table salaries: already exists.
Creating table dept_emp: already exists.
Creating table dept_manager: already exists.
Creating table titles: already exists.

## Inserting Data

In [16]:
#since we closed the connection, we need to reinstatiate it
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = DB_NAME
)
cursor = cnx.cursor()

In [17]:
# cursor = create_cnx()

In [18]:
from datetime import date, datetime, timedelta

tomorrow = datetime.now().date() + timedelta(days=1)

add_employee = ("INSERT INTO employees "
               "(first_name, last_name, hire_date, gender, birth_date) "
               "VALUES (%s, %s, %s, %s, %s)")
add_salary = ("INSERT INTO salaries "
              "(emp_no, salary, from_date, to_date) "
              "VALUES (%(emp_no)s, %(salary)s, %(from_date)s, %(to_date)s)")

data_employee = ('Geert', 'Vanderkelen', tomorrow, 'M', date(1977, 6, 14))

In [19]:
data_employee

('Geert',
 'Vanderkelen',
 datetime.date(2019, 10, 24),
 'M',
 datetime.date(1977, 6, 14))

In [20]:
cursor

In [21]:
# Insert new employee
cursor.execute(add_employee, data_employee)
emp_no = cursor.lastrowid

# Insert salary information
data_salary = {
  'emp_no': emp_no,
  'salary': 50000,
  'from_date': tomorrow,
  'to_date': date(9999, 1, 1),
}
cursor.execute(add_salary, data_salary)

# Make sure data is committed to the database
cnx.commit()

## Insert Many

cursor.executemany(operation, seq_of_params)

In [22]:
data = [
  ('Jane', date(2005, 2, 12)),
  ('Joe', date(2006, 5, 23)),
  ('John', date(2010, 10, 3)),
]
stmt = "INSERT INTO employees (first_name, hire_date) VALUES (%s, %s)"
cursor.executemany(stmt, data)

In [23]:
cnx.commit()

In [24]:
cursor.close()
cnx.close()

## Querying the DB

In [8]:
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = DB_NAME
)
cursor = cnx.cursor()

In [9]:
query = ("SELECT first_name, last_name, hire_date FROM employees "
         "WHERE hire_date BETWEEN %s AND %s")

hire_start = date(2005, 1, 1)
hire_end = date(2010, 12, 31)

cursor.execute(query, (hire_start, hire_end))

NameError: name 'date' is not defined

In [28]:
for (first_name, last_name, hire_date) in cursor:
  print("{}, {} was hired on {:%d %b %Y}".format(
    last_name, first_name, hire_date))

cursor.close()
cnx.close()

, Jane was hired on 12 Feb 2005
, Joe was hired on 23 May 2006
, John was hired on 03 Oct 2010
, Jane was hired on 12 Feb 2005
, Joe was hired on 23 May 2006
, John was hired on 03 Oct 2010

## Applied: Working with our student data

### Import our student data

In [20]:
import json

In [21]:
f=open('students.json','r')
data=json.load(f)

### Create a connection and cursor to AWS db

In [22]:
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = DB_NAME
)
cursor = cnx.cursor()

NameError: name 'DB_NAME' is not defined

### Create a table for our student info

In [23]:
data[3]

{'name': 'Clare Blessen',
 'dob': '1994-08-10',
 'birthplace': 'Chicago, IL',
 'siblings': 1,
 'years_in_nyc': 2,
 'favorite_food': 'cheese'}

In [21]:
create_query = """
                CREATE TABLE students
                (
                student_id int(10) NOT NULL UNIQUE AUTO_INCREMENT,
                name varchar(100) NOT NULL,
                dob date NOT NULL,
                birthplace varchar(100) NOT NULL,
                siblings int(2) NOT NULL,
                years_in_nyc float(5) NOT NULL,
                favorite_food varchar(500) NOT NULL
                )
                """

# drop_table = """DROP Table students;"""

In [22]:
cursor.execute(create_query)

In [24]:
type(data)

list

In [23]:
students_list = []

for student in data:
    if 'favoritefood' in student.keys():
        student['favorite_food'] = student['favoritefood']
    
    students_tuple = (student['name'], student['dob'],
                     student['siblings'], student['birthplace'],
                     student['years_in_nyc'], student['favorite_food'])
    students_list.append(students_tuple)

In [24]:
insert_query = """
INSERT INTO students (name, dob, siblings, birthplace, years_in_nyc, favorite_food) VALUES (%s, %s, %s, %s, %s, %s)
"""

In [25]:
cursor.executemany(insert_query, students_list)
cnx.commit()

### Insert the student data into the table

In [16]:
#
keys_list = []
for student in data:
    keys = student.keys()
    for word in keys:
        if word not in keys_list:
            keys_list.append(word)

### Write queries to answer the following questions:

**Questions**
- Which student is the youngest?
- Which student's birthday is closest to the cohort's graduation date?
- Which student has the most siblings?
- How many students are only children?
- Which 3 students have lived in NYC the shortest amount of time?
- How many students are native New Yorkers?
- What are the most popular foods among the class?

[Utilizing the date data type in MySQL](http://www.mysqltutorial.org/mysql-date/)

In [43]:
# Which student is the youngest?
import pandas as pdf
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    password = config.password,
    database = DB_NAME
)
cursor=cnx.cursor()

cursor.execute("""
SELECT
    name
FROM
    employees.students s
ORDER BY
    s.dob DESC
LIMIT 1
;
""")
cursor.fetchall()

[('Sasha Epelbaum',)]

In [47]:
# Which student's birthday is closest to the cohort's graduation date?

import pandas as pdf
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    password = config.password,
    database = DB_NAME
)
cursor=cnx.cursor()

cursor.execute("""
SELECT
    name,
    ABS(DAYOFYEAR(s.dob) -  DAYOFYEAR('2020/01/24')) AS days_from_graduation
FROM
    employees.students s
ORDER BY
    days_from_graduation
;
""")
cursor.fetchone()

('Sean Abu Wilson', 13)

In [12]:
# Which student has the most siblings?
import pandas as pdf
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    password = config.password,
    database = DB_NAME
)
cursor=cnx.cursor()

cursor.execute("""
SELECT
	name,
    siblings
FROM
	employees.students
WHERE
	siblings = (SELECT MAX(siblings) FROM employees.students)
;
""")
cursor.fetchall()

[('Eddie Pognon', 4), ('Wesley Willis', 4)]

In [13]:
#How many students are only children?
import pandas as pdf
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    password = config.password,
    database = DB_NAME
)
cursor=cnx.cursor()

cursor.execute("""
SELECT
    COUNT(name)
FROM
    employees.students
WHERE
    siblings = 0
;
""")
cursor.fetchall()

[(5,)]

In [1]:
# Which 3 students have lived in NYC the shortest amount of time?
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    password = config.password,
    database = DB_NAME
)
cursor=cnx.cursor()

cursor.execute("""
SELECT
    name,
    years_in_nyc
FROM
    employees.students
ORDER BY
    years_in_nyc
LIMIT
    3
;
""")
cursor.fetchall()

NameError: name 'mysql' is not defined

In [26]:
# How many students are native New Yorkers?
import pandas as pdf
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    password = config.password,
    database = DB_NAME
)
cursor=cnx.cursor()

cursor.execute("""
SELECT
	COUNT(name)
FROM
	employees.students
WHERE
	birthplace LIKE '%NY%'
    AND
    birthplace NOT LIKE '%Manhasset%'
    AND
    birthplace NOT LIKE '%Hyde%'
    AND
    birthplace NOT LIKE '%White%'
;
""")
cursor.fetchall()

[(6,)]

In [27]:
# What are the most popular foods among the class?
import pandas as pdf
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    password = config.password,
    database = DB_NAME
)
cursor=cnx.cursor()

cursor.execute("""
SELECT
	favorite_food
FROM
	employees.students
 WHERE
	favorite_food LIKE (
        SELECT
			favorite_food
		FROM
			employees.students
		GROUP BY
			favorite_food
		ORDER BY
			COUNT(favorite_food) DESC
		LIMIT
			1
		)
;
""")
cursor.fetchall()

[('pizza',), ('Pizza',)]